{"How to obtain 3 more oak logs in Minecraft?": "Answer: You can obtain 3 more oak logs in Minecraft by finding and chopping down an oak tree. Oak trees can be found in most biomes in the game. Use an axe to chop down the tree and it will drop oak logs.", "How to craft a crafting table in Minecraft?": "Answer: To craft a crafting table in Minecraft, you need four wooden planks. Arrange the planks in a square shape in the crafting grid to create a crafting table. Once crafted, you can use the crafting table to create more complex items and tools.", "How to craft a wooden pickaxe in Minecraft?": "Answer: To craft a wooden pickaxe in Minecraft, you will need three wooden planks and two sticks. Open the crafting table and place the wooden planks in the top row and sticks in the middle and bottom row of the left column. This will create a wooden pickaxe.", "How to mine 3 coals in Minecraft?": "Answer: To mine 3 coals in Minecraft, you will need to find a coal vein that has at least 3 coal blocks. Once you have located the vein, use a pickaxe to mine the coal blocks. Each coal block will drop one piece of coal, so you will need to mine three coal blocks to get three pieces of coal.", "How to craft a stone pickaxe in Minecraft?": "Answer: To craft a stone pickaxe in Minecraft, you will need three pieces of cobblestone and two sticks. Arrange the cobblestone in a \"V\" shape in the top row of the crafting table, and place the two sticks in a vertical line in the middle row. This will create a stone pickaxe.", "How to kill 1 chicken in Minecraft?": "Answer: You can kill a chicken in Minecraft by attacking it with your hand or any tool, such as a sword or an axe. One hit should be enough to kill a chicken.", "How to kill 1 pig in Minecraft?": "Answer: To kill a pig in Minecraft, you can use any weapon or tool, such as a sword or an axe. Simply approach the pig and attack it until its health bar is depleted and it dies. You can then collect its drops, which include raw porkchops and sometimes leather.", "How to craft a stone sword in Minecraft?": "Answer: To craft a stone sword in Minecraft, you will need two stone blocks and one stick. Place the two stone blocks vertically in the crafting table, with the stick in the middle, and you will get a stone sword.", "How to mine 3 irons in Minecraft?": "Answer: To mine 3 irons in Minecraft, you will need to find an iron ore block and mine it with a stone pickaxe or higher. Each iron ore block drops one iron ore, so you will need to find and mine three iron ore blocks to get three iron. Once you have the iron ore, you will need to smelt it in a furnace using coal or charcoal as fuel to turn it into iron ingots.", "How to smelt 3 raw iron in Minecraft?": "Answer: You can smelt 3 raw iron in Minecraft by placing them in a furnace along with a fuel source such as coal or charcoal. Once the furnace is lit, the raw iron will be smelted into 3 iron ingots.", "How to craft an iron pickaxe in Minecraft?": "Answer: To craft an iron pickaxe in Minecraft, you will need three iron ingots and two sticks. Place the iron ingots in a vertical line in the left column of the crafting table, and then place two sticks in a horizontal line in the middle row of the crafting table. This will create an iron pickaxe.", "How to cook 3 porkchops in Minecraft?": "Answer: To cook 3 porkchops in Minecraft, you will need to have a furnace and some fuel such as coal or wood. Place the furnace down and add the fuel to the bottom slot. Then, place the raw porkchops in the top slot and wait for them to cook. It takes about 10 seconds for each porkchop to cook, so you will need to wait for a total of 30 seconds for all 3 porkchops to cook. Once they are done, you can take them out of the furnace and enjoy your cooked porkchops!"}